In [1]:
import pandas as pd
import numpy as np
from os import listdir
from os.path import isfile, join

In [8]:
files = [f for f in listdir('data/') if isfile(join('data/', f))]

In [40]:
categories = pd.read_csv('data/categories.csv')
cities = pd.read_csv('data/cities.csv')
events = pd.read_csv('data/events.csv')
groups = pd.read_csv('data/groups.csv')
groups_topics = pd.read_csv('data/groups_topics.csv', encoding='ISO-8859-1')
members = pd.read_csv('data/members.csv', encoding='ISO-8859-1')
members_topics = pd.read_csv('data/members_topics.csv')
topics = pd.read_csv('data/topics.csv', encoding='ISO-8859-1')
venues = pd.read_csv('data/venues.csv')

In [53]:
categories.head(3)

   category_id       category_name shortname           sort_name
0            1      Arts & Culture      Arts      Arts & Culture
1            2   Career & Business  Business   Career & Business
2            3  Cars & Motorcycles      Auto  Cars & Motorcycles

In [42]:
cities.head(3)

,city,city_id,country,distance,latitude,localized_country_name,longitude,member_count,ranking,state,zip
0,West New York,7093,us,2524.541,40.790001,USA,-74.010002,661,32,NJ,7093
1,New York,10001,us,2526.837,40.750000,USA,-73.989998,229371,0,NY,10001
2,New York Mills,13417,us,2392.162,43.099998,USA,-75.290001,22,109,NY,13417

In [55]:
events.['venuecity

AttributeError: 'DataFrame' object has no attribute 'venue_city'

In [44]:
groups.head(3)

,group_id,category_id,category.name,category.shortname,city_id,city,country,created,description,group_photo.base_url,...,organizer.photo.photo_link,organizer.photo.thumb_link,organizer.photo.type,rating,state,timezone,urlname,utc_offset,visibility,who
0,6388,14,health/wellbeing,health-wellbeing,10001,New York,US,2002-11-21 16:50:46,Those who practice or hold a strong interest i...,https://secure.meetupstatic.com,...,https://secure.meetupstatic.com/photos/member/...,https://secure.meetupstatic.com/photos/member/...,member,4.39,NY,US/Eastern,alternative-health-nyc,-14400,public,Explorers of Health
1,6510,4,community/environment,community-environment,10001,New York,US,2003-05-20 14:48:54,The New York Alternative Energy Meetupis for t...,https://secure.meetupstatic.com,...,https://secure.meetupstatic.com/photos/member/...,https://secure.meetupstatic.com/photos/member/...,member,4.31,NY,US/Eastern,alternative-energy-meetup,-14400,public,Clean Energy Supporters
2,8458,26,pets/animals,pets-animals,10001,New York,US,2004-03-27 09:55:41,not_found,https://secure.meetupstatic.com,...,https://secure.meetupstatic.com/photos/member/...,https://secure.meetupstatic.com/photos/member/...,member,4.84,NY,US/Eastern,Animals,-14400,public,Animal Voices

In [45]:
groups_topics.head(3)

   topic_id   topic_key  topic_name  group_id
0        83  sportsfans  Sports Fan    241031
1        83  sportsfans  Sports Fan    289172
2        83  sportsfans  Sports Fan    295444

In [46]:
members.head(3)

,member_id,bio,city,country,hometown,joined,lat,link,lon,member_name,state,member_status,visited,group_id
0,3,not_found,New York,us,"New York, NY",2007-05-01 22:04:37,40.72,http://www.meetup.com/members/3,-74.0,Matt Meeker,NY,active,2009-09-18 18:32:23,490552
1,3,not_found,New York,us,"New York, NY",2011-01-23 14:13:17,40.72,http://www.meetup.com/members/3,-74.0,Matt Meeker,NY,active,2011-03-20 01:02:11,1474611
2,3,"Hi, I'm Matt. I'm an entrepreneur who has star...",New York,us,"New York, NY",2010-12-30 18:47:34,40.72,http://www.meetup.com/members/3,-74.0,Matt Meeker,NY,active,2011-01-18 20:37:23,1490492

In [47]:
members_topics.head(3)

   topic_id   topic_key  topic_name  member_id
0        83  Sports Fan  sportsfans     121483
1        83  Sports Fan  sportsfans     165644
2        83  Sports Fan  sportsfans     327482

In [48]:
topics.head(3)

,topic_id,description,link,members,topic_name,urlkey,main_topic_id
0,83,Meet with others in your local area who are Sp...,http://sportsfans.meetup.com/,471594,Sports Fan,sportsfans,10451
1,130,Meet with Latin Music fans in your town.,http://latinmusic.meetup.com/,759757,Latin Music,latinmusic,15018
2,182,Want to practice your English? Meetup with oth...,http://esl.meetup.com/,3176752,English as a Second Language,esl,10454

In [49]:
venues.head(3)

,venue_id,address_1,city,country,distance,lat,localized_country_name,lon,venue_name,rating,rating_count,state,zip,normalised_rating
0,5286,424 Park Ave S,New York,us,0.0,40.744259,USA,-73.983749,Starbucks Coffee,4.00,51.0,NY,10016,3.92
1,5293,Union Square,New York,us,0.0,40.731390,USA,-73.988400,Virgin Megastore (cafe),2.83,109.0,NY,10003,2.80
2,8356,141 West 72nd St.,New York,us,0.0,40.778275,USA,-73.980095,Krispy Kreme Doughnuts,2.11,18.0,NY,10028,2.00